<template>
  <section :class="b()">
    <h2 :class="b('title')">
      Часто задаваемые вопросы
    </h2>

    <ul :class="b('list')">
      <li
        v-for="(item, index) in items"
        :key="index"
      >
        <button
          :class="b('button', { active: isActive(index) })"
          @click="open(index)"
        >
          {{ item.title }}
        </button>

        <div
          v-if="isActive(index)"
          :class="b('wrapper')"
        >
          <p :class="b('text')">
            {{ item.description }}
          </p>
        </div>
      </li>
    </ul>
  </section>
</template>

<script>
  export default {
    name: 'section-faq',
    data() {
      return {
        activeIndex: null,
        items: [
          {
            title: 'Какое жилье мы предлагаем?',
            description: `
              Совместно с каждым партнером мы подбираем комфортабельное жилье и обустраиваем рабочее место, учитывая все пожелания.
              Расходы по аренде и коммунальным услугам студия берет на себя на весь срок сотрудничества.
              P.S. Если устраивает текущее место проживания - мы возьмем все расходы на себя по содержанию и созданию рабочего места.
            `
          },
          {
            title: 'Что подразумевается под бесплатным обучением?',
            description: `
              Обучение- это не средство достижения цели, а сама цель. Помимо основных навыков для старта работы,
              по желанию предлагается выбрать какое-либо хобби, будь то второй иностранный язык, спортивный зал,
              танцы ...  А расходы мы возьмем на себя
            `
          },
          {
            title: 'Как обеспечивается конфиденциальность данных?',
            description: `
              Помимо личной локации у каждого партнёра, студия обеспечит защиту персональных данных и даст рекомендации
              по ведению социальных сетей.
            `
          },
          {
            title: 'Для чего нужна служба поддержки?',
            description: `
              Нет строгих временных рамок, всегда есть возможность выбрать комфортное время работы, а техническая поддержка
              всегда ответит на все вопросы в любое время суток.
            `
          },
          {
            title: 'Как подбирается жилье?',
            description: `
              Отталкиваясь от предпочтений студия поможет создать уютный уголок с современной техникой,
              где будет комфортно проводить время за работой.
            `
          },
          {
            title: 'Немного о начальстве',
            description: 'Мы не ищем рабочую силу, мы ищем партнеров-единомышленников, готовых развиваться вместе с нами.'
          }
        ]
      };
    },
    methods: {
      open(index) {
        if (index === this.activeIndex) {
          this.activeIndex = null;
          return;
        }

        this.activeIndex = index;
      },

      isActive(index) {
        return index === this.activeIndex;
      }
    }
  };
</script>

<style lang="scss" src="./component.scss" />
