<template>
  <section :class="b()">
    <h2 :class="b('title')">
      О нас
    </h2>

    <p :class="b('description')">
      Задача Flatsstudio - помочь каждому партнеру сделать карьеру в вебкам-инсдустрии
      и обеспечить личностный рост, используя накполенные навыки и все необходимые инструменты в работе.
      <br>Интегрированная европейская модель менеджмента не только позволит чувствовать себя комфортно
      на всех этапах сотрудничества, но и гарантированно приведет к заработку <br>от 100 000 р. уже на второй месяц.
    </p>
  </section>
</template>

<script>
  export default {
    name: 'section-about'
  };
</script>

<style lang="scss" src="./component.scss" />
